#include<stdio.h>

// *与++、-- 优先级相同，结合方向为从右到左 //
 
int main()
{
	int *p1,*p2,*p3,*p4,i;
	int a[4];
	printf("Please enter 5 integers:");
	for(i=0;i<4;i++)
	scanf("%d",&a[i]);
	
	// <1> *p++
	// *p++ 等价于 *(p++) 
	// 即先引用 p 的值，进行 *p 的运算，然后再使 p 自增 1 (不是使 *p 自增 1！！！) 
	p1=&a[0];
	printf("*p1++ = %d\n",*p1++);
	printf("*p1 = %d\n\n",*p1); //验证 p1 是否加了 1 
	
	// <2> (*p)++
	// 先取 *p，引用 *p 的值，再使 *p 自增 1
	p2=&a[1];
	printf("(*p2)++ = %d\n",(*p2)++);
	printf("*p2 = %d\n\n",*p2); //验证 p2 指向的值是否加了1 
	
	// <3> *(++p)
	// *(++p) 是先使 p 自增 1，再取 *p
	p3=&a[2];
	printf("*(++p3) = %d\n",*(++p3));
	printf("*p3 = %d\n\n",*p3); //验证 p3 是否加了 1 
	
	// <4> ++*p
	// ++*p 等价于 ++(*p) 
	// ++*p 是先取 *p，再使 p 所指向的元素值加 1 ，再引用这个值 
	p4=&a[3];
	printf("++*p4 = %d\n",++*p4);
	printf("*p4 = %d\n",*p4); //验证 p4 指向的值是否加了 1 
	 
	/***** summary *****/
	// 若p当前指向数组a的第i个元素a[i] 
	// <1> *p++/*p-- == *(p++)/*(p--) == a[i++]/a[i--] 
	// <2> (*p)++/(*p)-- == a[i]++/a[i]--
	// <2> *(++p)/*(--p) == a[++i]/a[--i]
	// <3> ++*p/--*p == ++(*p)/--(*p) == a[i]++/a[i]-- 
	
	return 0;
} 
