/* 二维数组的初始化 */ 
#include<stdio.h>

int main()
{
	//(1) 分行给二维数组赋初值
	int a[3][4]={{1,2,3,4},{5,6,7,8},{9,10,11,12}}; //对全部元素赋初值 
	
	int b[3][4]={{1},{5,6},{9,10,11}}; //对部分元素赋初值，未被赋值的元素系统自动分配为0 
	
	int c[3][4]={{1},{5,6}}; //只对某几行元素赋初值，未赋值的元素系统自动分配为0 
	int d[3][4]={{1},{},{9,10,11}}; //对第二行不赋值 
	 
	//(2) 可以将所有数据写在一个花括号内，按数组元素在内存中的排列顺序对各元素赋初值
	int e[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};
	
	int f[3][4]={1,2,3,4,5,6,7}; //其余元素系统自动分配为0 
	
	//(3) 定义时可以省略第一维的长度
	int g[][4]={1,2,3,4,5,6,7,8,9,10,11,12}; //系统会根据第二维的长度和数据总个数推算出第一维的长度 
	 
	int h[][4]={1,2,3,4,5,6,7,8,9,10};
	int i[][4]={1,2,3};
	//系统在推算第一维的长度时，是根据第二维的长度一行一行来算的
	// 上面的数组 h 会分配3行，最后两个元素为0
	// 数组 i 只会分配一行，最后一个元素为0 
	
	int j[][4]={{1,2,3},{},{9,10}};
	//这样的写法可以告知编译系统，数组有三行 
	return 0;
}
