/* C语言常量 */
#include<stdio.h>

// 常量：在程序运行过程中，其值不能被改变的量称为常量 
int main()
{
	/*** <1> 整型常量 ***/ 
	100, 0, 1, -1, -123; 
//-----------------------------------------------------------------------------------------------------------//
	
	/*** <2> 实型常量 ***/
	
	//(1) 十进制小数形式 由小数和小数点组成 
	123.456, 0.345, 0.0, -0.123, -56.78;
	
	//(2) 指数形式 
    1.2e3, -34.56e3, 3.4e-5, -6.7e-8;
    //*** 由于在计算机输入或输出时无法表示上角或下角，故规定以字母 e 或 E 代表以 10 为底的指数
	//*** 但应注意：e或E之前必须有数字，且e或E后面的必须为整数！！！
	e4, 12e2.5; //会报错 
//-----------------------------------------------------------------------------------------------------------//
	
	/*** <3> 字符常量 ***/
	
	//(1) 普通字符 即用单撇号括起来的 单个 字符 
	'a', 'A', ' ', '0', '1','?';
	//***注意：单撇号内只能写 单个 字符 ，不能写其他变量名或者是多个字符
	'ab', '12'; //会报错
	//注意：单撇号只是界限符，字符常量只能是一个字符，不包括单撇号 
	
	//(2) 转义字符 即以字符 \ 开头的字符序列
	
//-----------------------------------------------------------------------------------------------------------//	
	
	/*** <4> 字符串常量 ***/
	// 用双撇号将若干个字符括起来
	"I am Groot", "Hello World"; 
//-----------------------------------------------------------------------------------------------------------//

    /*** <5> 符号常量 ***/
	//用 #define 指令，指定用一个符号名称代表一个常量
	#define PI 3.14 //注意 没有 = 和 ; 
	// 符号常量不占内存 
	// 为与变量名相区别，习惯上符号常量用大写表示 
	
	return 0;
} 
