/* 运算符优先级：   
                  ！(非NOT) (优先级最高) 
                  算术运算符 (+、-、*、/、%) (先乘除后加减)
				  关系运算符 (<、<=、>、>=) (优先级相同且高于等于和不等于) 
				             (==、!=) (优先级相同且较低)
				  &&(和AND) ||(或OR) (&&高于||) 
				  赋值运算符(=) (优先级最低)
*/

/* eg: 5>3 && 8<4-!0   运算结果为0  
   
   a=1;b=2;c=3;d=4;m=1;n=1;
   (m=a>b)&&(n=c>d)  the value of m is 0, the value of n is 1
   (m=a>b&&n=c>d)  第二个等号会报错 系统报错该等号没有左值
   
    L value and R value 左值和右值
   放在赋值运算符左边的叫左值，右边的叫右值
   左值只能为变量，右值可以为变量或数值
   左值都可以作右值，右值不一定能作为左值 

   
/* C语言编译系统在表示逻辑运算的结果（即关系和逻辑表达式的结果）时，用数值 1 代表真，用数值 0 代表假
   *****但在判断一个量的真假时，以 0 代表假，以 非0数值 代表真*****
   eg：
       a=3，!a的值为0
	   a=3,b=4,则 a&&b的值为1
	   if(1) 结果为真 执行后面的语句 
*/ 
	    
#include<stdio.h>

int main()
{
	int x;
	scanf("%d",&x);
	if(x) // if语句括号内表达式的值 非0则表示真 0表示假 
	  x++;
	else
	  x--;
	printf("%d\n",x);
	   
}				   
