// 指针 = 地址
// 地址 >>> 变量单元  对变量的访问都是通过地址进行的
//  直接访问：按变量名进行访问
//  间接访问：将变量i的地址存放到另一变量中，再通过该变量找到变量i的地址，从而访问变量i 

// 指针变量 ！= 指针
// 指针变量：专门用来存放另一变量的地址(即指针)的变量  指针变量的值是指针 

// 指针是地址，而指针变量是存放指针的变量 
#include<stdio.h>

int main()
{
	int a=1; 
	int *pointer_1=&a;// 指针变量前的 * 表示该变量为指针变量 指针变量名是pointer_1而不是*pointer_1 
	        // 在定义指针变量时必须声明其基类型  指针变量的基类型用来指定可以把地址存储在该指针变量的变量的类型 
	        // 可以在定义指针变量的同时对其初始化 
	               
	float *pointer_2; //定义float指针 
	double *pointer_3; //定义double指针 
	char *pointer_4; //定义char指针 
	//对应各种数据类型，都可以定义指向该种数据类型的指针 
	
	int *p1 = NULL; //给 p1 赋值为 NULL 含义是空指针 
	int *p2 = 0; // NULL 的ASCII码是 0  这么写与上面一句是等价的 
	
	return 0;
}
