#include<stdio.h>
#include<stdlib.h>

int main()
{
	//<1> 存储内容不同 
	//字符数组由若干个元素组成，每个元素中存放一个字符
    //字符指针变量是一个变量，存放的是字符串首元素的地址，绝不是将字符串放到字符指针变量中
	
	//<2> 赋值方式
	// 可以对字符指针赋值，但不可以对数组名赋值
	char *p1="I am Groot"; //可以
	
	char *p2;
	p2="I am Groot"; //可以 
	
	char str1[]="I am Groot"; //可以 
	
	char str2[15];
	str2="I am Groot"; //不可以，因为str2是一个指针常量，不能对其赋值
	
	//<3> 初始化的含义
	char str3[15];
	str3[]="I am Groot"; 
	//不可以，因为数组可以在定义时对各元素赋初值，但不能用赋值语句对字符数组中全部元素整体赋值 
	
	//<4> 内存
	//编译时为字符数组分配若干存储单元，以存放各元素的值
	//而对字符指针变量，只分配一个存储单元 
	
	char str4[5];
	// 若定义了一个字符数组而未对它赋值，这时数组中各元素的值是不可预料的
	// 可以引用、输出这些值，结果显然毫无意义， 但是不会造成严重的后果，容易发现并改正
	
	char *p3;
	scanf("%s",p3);
	// 若定义了一个字符指针变量，应当及时把一个字符变量或字符数组元素的地址赋给它
	// 如果未对它赋予一个地址值，那么它并未具体指向一个确定的对象 
	// 此时若向该字符指针变量所指向的对象输入数据，可能会出现严重的后果 
	
	// 因为编译时给指针变量p3分配了存储单元，即变量p3的地址是确定的
	// 但p3并未被赋值，p3的存储单元中是一个不可预料的值
	// 在执行scanf函数时，要求将一个字符串输入到p3所指向的一段存储单元中
	// 它可能指向空白的用户存储区，也有可能指向已存放指令或数据的有用内存段
	// 这就有可能会破坏程序和数据，甚至破坏系统，造成严重后果
	// 应当绝对防止这种情况的出现，所以应当在定义指针变量后，及时指定其指向 
	 
	// 可以用malloc给指针变量分配一段内存单元
	char *p4=(char *)malloc(15);
	scanf("%s",p4); //用gets也可以
	
	return 0;
}
