/* 字符串复制函数 strcpy and strncpy // (STRing CoPY) */ 

#include<stdio.h>
#include<string.h> 

int main()
{ 	
    /* (1) strcpy函数作用是将字符串2复制到字符串1中去 */
	// 一般形式为：strcpy(字符数组1,字符串2)
	
	char str1[15]={'\0'}; // 注意：字符数组1必须足够大，可以容纳被复制的字符串2
	char str2[15]={'A','A','A','A','A','A','A','A','A','A','A','A','A','A','A'};
	char str3[]={"I am Groot"};
	
	strcpy(str1,str3);         // 字符数组1必须写字符数组名 
	strcpy(str2,"I am Groot"); // 字符串2可以是字符数组名，也可以是字符串常量 
	
	puts(str1);     //***** 注意：虽然输出的结果是相同的，都是I am Groot
	puts(str2);     //***** 但是 str3 和 str4 不完全相同 ！！！ 
	printf("\n");
    /******************************************************************************************* 
	   因为在使用strcpy函数时，复制时是将字符数组2中的字符串和其后的'\0'一起复制到字符数组1中
	   取代前面的字符，而字符数组1中后面原有的字符不会发生改变
	*******************************************************************************************/ 
	// 若改用以下输出方式 ： 
	int i,j;
	
	for(i=0;i<15;i++)
	printf("%c",str1[i]); 
	printf("\n");
	
	for(j=0;j<15;j++)
	printf("%c",str2[j]); // 后面的 A 仍然存在，会被输出出来 
	printf("\n");
	printf("\n");
/*----------------------------------------------------------------------------------------------------------*/

    /* (2) strncpy函数的作用是将字符数组2中 前面n个字符 取代字符数组1中前面n个字符 */
	// 一般形式为 strncpy(字符数组1,字符数组2,n)
	
	char str4[15]={"Hello World"};
	char str5[15]={"I am Groot"};
	
	puts(strncpy(str4,str5,5));   // 注意：复制的字符个数 n 不应多于字符数组1中原有的字符 (不包括'\0') 
	
	return 0;
}
	
