#include<stdio.h>

int main()
{
	// (1) 自动变量 (auto变量)
	// 声明形式：auto int a; (实际上，关键字auto可以省略，在函数中定义的变量未声明为auto都隐含指定为自动变量) 
	// 包括函数中的形参、在函数中定义的局部变量、在复合语句中定义的局部变量
	// 在调用函数时，系统会给自动变了分配存储空间，在函数调用结束时就自动释放这些存储空间
	
	// (2) 静态局部变量 (static局部变量)
	// 声明形式：static int a; 
	// static变量存储在全局区中，程序结束后内存单元才释放，程序运行过程中一直存在
	 
	// (3) 寄存器变量 (register变量) （极少用，基本上无作用） 
	// 将局部变量的值存放在CPU中的寄存器中
	// 可以提高程序执行效率和运行速度
	 
	int fun(int a);
	int a = 2, i;
	for(i = 0;i < 3;i++)
	  printf("%d\n", fun(a));
	  
	return 0;
} 

int fun(int a)
{
	int b = 0;
	static int c = 3; // c在每次函数调用结束之后，并不是放，仍保留上一次的值 
	b = b + 1;
	c = c + 1;
	return (a+b+c);
}
// <1>
// 对静态局部变量是在编译时赋初值，即只赋初值一次，在程序运行时它已有初值
// 以后每次调用函数时不再重新赋初值，而是保留上次函数调用结束时的值 

// 对自动变量赋初值，不是在编译时进行，而是在函数调用时进行
// 每调用一次函数重新赋一次初值，相当于执行一次赋值语句（因为每次调用函数后，自动变量都从stack中弹出了） 

// <2>
// 对静态局部变量，若在定义时未赋初值，编译时自动赋初值 0 或 '\0'
// 对自动变量，若在定义时未赋初值，它的值是一个不确定的值

//*** <3>
//***注意：虽然静态局部变量在函数调用结束后仍然存在，但其他函数时不能引用它的!!!!!

 
