/* 字符数组的输入和输出 */

/* 字符数组输入输出有两种方式 */
// (1) 以字符形式逐个输入输出: 用格式符 %c 输入或输出一个字符 
// (2) 以字符串形式一次输入输出: 用格式符 %s 输入或输出字符串 
#include<stdio.h>

int main()
{
	/* 输入和输出时的注意事项 */ 
	
	/* 输 入 */  printf("输入\n"); 
	char c[10];
	scanf("%s",c); // 如果利用scanf函数，并且输入项是字符数组名，不要再加地址符&和方括号[]
	// 因为 C语言中数组名就代表了该数组的起始地址 
	
	printf("%s\n",c); // 如果利用printf函数和%s，输出项写字符数组名，而不是数组元素名
	
	// 如果用一个scanf函数输入多个字符串，则应在输入时以空格分隔
	// 系统把空格字符作为输入的字符串之间的分隔符
	char str1[5],str2[5],str3[5];
	char str[15];
	
	scanf("%s%s%s",str1,str2,str3); //输入:How are you?
	printf("%s %s %s\n",str1,str2,str3); //输出结果:How are you? 
	
	scanf("%s",str); //输入:How are you?
	printf("%s\n",str); //输出结果:How   只把空格前的字符How送到str中，把How作为一个字符串处理 
	
	/* 输 出 */  printf("输出\n"); 
	char a[]={'H','e','l','l','o','\0','w','o','r','l','d'};
	
	printf("%s\n",a); 
	/* 以字符串形式一次输出 */ 
	// Hello后有一个空字符'\0'，表示字符串结束，world不会被输出  
	
	int i;
	for(i=0;i<=10;i++)
	printf("%c",a[i]); 
	/* 以字符形式逐个输出 */ 
	// 空字符也被认作字符，若用%c则以空格形式输出，其后world也会被输出
	 
	/* 
	输出时  '\0'是字符 串 结束标志
	    若用%s输出，则输出到'\0'截止
	    若用%c输出，则仅仅会输出一个空格字符，其后字符仍然可以被输出 
	*/ 
	
	return 0;
}
