#include<stdio.h>
#include<string.h>

int main()
{
	// 当我们用一个字符串给字符数组初始化，或者是输入一个字符串赋给字符数组时
	// 系统会自动在字符串的末尾添加 '\0'
	//***** 当然 前提是这个字符数组足够长，可以再放下一个'\0' 
	char str1[]="I am Groot";
	
	char str2[15];
	scanf("%s",str2); 
	
	char str3[10]="I am Groot";
	printf("%s\n",str3); //末尾出现乱码 结果是undefined
	
	//***使用strlen函数时也会有问题，结果是undefined
	// 但是感谢Dev-C++  神TM 可以用  
	
	//*** printf输出字符串的工作过程可以理解为如下代码： 
	// int i;
	// for(i=0; a[i] != '\0'; i++)
    //   printf("%c", a[i]);
    // 如果末尾没有'\0'，循环什么时候停止是不确定的（如果定义的是局部数组，那么数组各元素的值是不确定的）
	// 甚至可能出现数组越界的情况 
		
	// 但是如果字符数组未初始化，而是我们手动初始化 或者是我们自己构建一个字符串时
	// 系统不会在末尾自动添加'\0' 
	char str4[15]={'I',' ','a','m',' ','G','r','o','o','t'}; //末尾不会添加'\0' 
	
	char str5[15];
	int i;
	for(i=0;i<15;i++) 
	  str5[i]='a';  // 循环结束之后是不会自动加上'\0'的 
	
	
	return 0;
}
