/* 局部变量 (local)*/ 

/*** 变量的定义有三种情况 ***/ 
// (1) 在函数的开头定义
// (2) 在函数内的复合语句定义
// (3) 在函数的外部定义
 
// 满足 (2)、(3) 的称为局部变量
// 该局部变量只能在函数内或复合语句内使用
 
#include<stdio.h>

int fun(int a,int b) // 形参也是局部变量 
{
	int c;
	c=a+b;
	return c;
}

int main()  // main函数中定义的变量也只在main函数中有效 
{
	int a,b; // 不同的函数可以使用同名的变量，它们代表不同的对象，互不干扰 
	int c;
	c=a+b;
	
	{
	  int a,b;  // 在一个函数的内部，可以再复合语句中定义变量，这些变量只在本复合语句中有效 
	  int c;    // 这种复合语句称为 分程序 或 程序块 
	  c=a+b;    // 用花括号括起来的一个程序块(例如for、while后跟的程序块) 
	} 
	
	return 0;
} 



