#include<stdio.h>

int main()
{
	int a[10];
	int *p=a;
    int i;
    printf("Please enter 10 integers:");
    for(i=0;i<10;i++)
    scanf("%d",&a[i]);
	 
    // 如果 p 的初值为 &a[0],则 p+i a+i 就是数组元素a[i]的地址
	// 并且 *(p+i) *(a+i) a[i] 三者是等价的
	
	/* 指针法 */
    // <1> p+i 其中 p=a 
	for(i=0;i<10;i++)       
    printf("%d ",*(p+i)); 
    printf("\n");
    
    // <2> a+i 其中a是数组名 
    for(i=0;i<10;i++)     
    printf("%d ",*(a+i));
    printf("\n");
    
    // <3> 
    for(p=a;p<a+10;p++)
    printf("%d ",*p);
    printf("\n");
    
    // 上面三种方法中
	// 1和2都是先通过指针、数组名、下标计算出元素地址，再找到该元素
	// 3是直接用指针变量指向该元素，不必每次都重新计算地址
	// 3比1、2程序运行时的速度更快 
	
	//*****注意：如果不用p变化的方法二用数组名a变化的方法是不行的
	// 若改为 
	// for(p=a;a<p+10;a++)
	// printf("%d ",*a);
	//  因为数组名 a 代表的是数组首元素的地址，是一个指针型常量，不能改变a的值，所以a++无法实现 
    
    /* 下标法 */ 
    // <1>
    for(i=0;i<10;i++)     
    printf("%d ",a[i]); 
    printf("\n");        
    //***** [] 实际上是一个运算符，叫做变址运算符 
    //***** a[i]实际上是按 a+i 计算地址，然后找出该地址单元中的值
	
	/* 其他方法 */ 
	// [] 变址运算符 
	// 指向数组元素的指针变量也可以带下标 例如 p[i] 
	
	// p[i]：
	// <1> 计算p+i，得到相应的地址 (并不会改变 p 的值!!!!!) 
	// <2> 按得到的地址值找出该地址单元中的值   
	 
    // <1>
    p=a;
    for(i=0;i<10;i++)
    printf("%d ",p[i]); //利用变址运算符 
    printf("\n");
    
    // <2>
	p=a;
	for(i=0;i<10;i++) 
	printf("%d ",*p++);
	printf("\n");
	
	return 0;
}
